import random

# 定义常量
FIRST_NAMES = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱',
               '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢',
               '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌',
               '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛',
               '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮',
               '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵',
               '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅',
               '庞', '熊', '纪', '舒', '屈', '项', '祝', '董', '梁']
LAST_NAMES = ['妍明', '润红', '浩刚', '伦伟', '瑶芳', '倩娟', '旭杰', '钰磊', '娅霞', '婉倩', '昊军', '琪静', '蕾秀',
              '旺强', '瀚亮', '德勇', '珂敏',
              '雯莉', '娅蕾', '欣婷', '菁妮', '婷春', '蓉琴', '婷华', '皓东', '怡丽', '瑶雪', '瀚飞', '菲娜', '茜洁',
              '翔峰', '泽宇', '蕊宁', '铭波',
              '凡阳', '梓刘', '梦梅', '弘林', '威宝', '鹏龙', '文兵', '瑜媛', '怡蓉', '柏毛', '嘉安', '嘉云', '佳博',
              '豪超', '华雄', '泽宏', '佳文',
              '睿俊', '锦威', '泽荣', '芝琳', '秀娥', '子露', '娟玲', '瑞翔', '瑞辉', '旭钢', '美妹', '瑞旭', '婷峥',
              '婷丹', '雨菲', '健涛', '浩川',
              '宁平', '嘉震', '俊鹏', '清竹', '琪亦', '秋清', '茜琼', '梦薇', '娟燕', '橘猫', '豆狗', '嘉鱼', '伟虎',
              '雅鸟', '宝熊', '嘉猴', '婷兔',
              '婷蛋', '欣猪', '梦虾', '佳鱼']


# 生成手机号码函数
def generate_phone_number():
    prefix = ['130', '131', '132', '133', '135', '136', '137', '138', '139', '150', '151', '152', '153', '155', '156',
              '157', '158', '159', '170', '176', '177', '178', '180', '181', '182', '183', '184', '185', '186', '187',
              '188', '189']
    return random.choice(prefix) + ''.join(random.choice('0123456789') for _ in range(8))


# 生成联系人列表
contacts = []
for i in range(888):
    name = random.choice(FIRST_NAMES) + random.choice(LAST_NAMES)
    phone = generate_phone_number()
    contacts.append({'name': name, 'phone-number': phone})

# 将联系人保存为.vcf文件
with open('随机通讯录.vcf', 'w', encoding='utf-8') as f:
    for contact in contacts:
        f.write('BEGIN:VCARD\n')
        f.write('VERSION:3.0\n')
        f.write('N:{}\n'.format(contact['name']))
        f.write('FN:{}\n'.format(contact['name']))
        f.write('TEL;TYPE=CELL:{}\n'.format(contact['phone-number']))
        f.write('END:VCARD\n')
        print(contact)

print('Done!')
